def z1():
    countries_dictr = {"Австрия": "Вена", "Бельгия": "Брюссель", "Великобритания": "Лондон", "Германия": "Берлин",
                       "Ирландия": "Дублин", "Лихтенштейн": "Вадуц", "Нидерладны": "Амстердам",
                       "Франция": "Париж", "Белоруссия": "Минск", "Болгария": "София", "Польша": "Варшава",
                       "Чехия": "Прага", "Албания": "Тирана", "Босния и Герцеговина": "Сараево",
                       "Северная Македония": "Скопье", "Сербия": "Белград"}

    for country, dictr in countries_dictr.items():
        sort = dict(sorted(countries_dictr.items()))
        print(country, '-', dictr)

    print(sort)

def z2():
    alph = {
        "а": 1,
        "б": 3,
        "в": 1,
        "г": 3,
        "д": 2,
        "е": 1,
        "ё": 3,
        "ж": 5,
        "з": 5,
        "и": 1,
        "й": 4,
        "к": 2,
        "л": 2,
        "м": 2,
        "н": 1,
        "о": 1,
        "п": 2,
        "р": 1,
        "с": 1,
        "т": 1,
        "у": 2,
        "ф": 10,
        "х": 5,
        "ц": 5,
        "ч": 5,
        "ш": 8,
        "щ": 10,
        "ъ": 10,
        "ы": 4,
        "ь": 3,
        "э": 8,
        "ю": 8,
        "я": 3
    }

    word = input("Введите слово:")
    summ = 0
    for i in alph:
        for j in word:
            if i == j:
                summ += alph[i]
    print(summ)

def z3():
    students = [{
        "Петров": {"Английский", "Русский", "Китайский"},
        "Зайцев": {"Английский", "Русский"},
        "Котов": {"Русский", "Французкий", "Китайский"},
        "Шариков": {"Русский", "Китайский"},
        "Шляпин": {"Английский", "Немецкий", "Русский"}}]


z1()
z2()
z3()
